// 数字黑洞.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <cstdio>
#include <algorithm>
using namespace std;

void Hsort(int N, int &N1, int &N2)//这里我给函数硬加了N1，N2两个参数用于传回数据；
{
    int a[4];
	N1 = 0, N2 = 0; //这两个赋值初始化不能省略！
	for (int i = 0; i < 4; i++)
	{
		a[i] = N % 10;
		N = N / 10;
	}
	sort(a, a + 4);
	for (int i = 0; i < 4; i++)
	{
		N1 = N1 * 10 + a[i]; //小的数
	}
	for (int i = 3; i >= 0; i--)
	{
		N2 = N2 * 10 + a[i];//大的数
	}
	/*我原来用的方法如下，现在用两个for循环代替
	N1 = a[0] * 1000 + a[1] * 100 + a[2] * 10 + a[3];
	N2 = a[0] + a[1] * 10 + a[2] * 100 + a[3] * 1000;
	*/
}

int main()
{
	int N, N1, N2, x = 0;
	scanf_s("%d", &N);
	Hsort(N, N1, N2);
	printf("%d %d\n", N1, N2);
	if (N1 == N2)
	{
		printf("N - N = 0000");
	}
	else
	{
		do
		{
			x = N2 - N1;
			printf("%04d - %04d = %4d\n", N2, N1, x);
			Hsort(x, N1, N2);
		} while (x != 6174);
	}
	system("pause");
	return 0;
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
